Breeder/OSIG/TurboMachinery/tutorials/cgnsConverters/test2/case/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/page/projets/BoucleOptim/OpenFOAM";
    case            "test1";
    instance        "0";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-1 -1 0.01);

boundaryField
{
    hub
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shroud
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    perio1
    {
        type            cyclic;
    }

    inflow
    {
        type            fixedValue;
        value           uniform (-4.7 -5.2 0);
    }

    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
