Breeder/OSIG/TurboMachinery/tutorials/cgnsConverters/test2/case/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/page/projets/BoucleOptim/OpenFOAM";
    case            "test1";
    instance        "0";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    hub
    {
        type            zeroGradient;
    }
    shroud
    {
        type            zeroGradient;
    }
    inflow
    {
        type            zeroGradient;
    }
    outflow
    {
        type            fixedValue;
        value   uniform 0;
    }
    perio1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
