Breeder/OSIG/TurboMachinery/tutorials/cgnsConverters/test2/case/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/page/projets/BoucleOptim/OpenFOAM";
    case            "test1";
    instance        "system";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p               ICCG 1e-08 0.001;
    U               BICCG 1e-07 0.01;
    k               BICCG 1e-06 0.1;
    epsilon         BICCG 1e-06 0.1;
    R               BICCG 1e-05 0.1;
    nuTilda         BICCG 1e-05 0.1;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    tolCritResUEqn  0.000025;
    tolCritResPEqn  0.000025;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}


// ************************************************************************* //
